tutorials/multiphase/interIsoFoam/porousDamBreak/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

# Plotting comparison with experimental data
gnuplot surface_compare.plt

#------------------------------------------------------------------------------
